Alpha-Healthcare/Hardware/BOARD/Fascin8_v3.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
SH.GPXTI1.0=GPIO_EXTI1
ProjectManager.MainLocation=Core/Src
PB13.GPIOParameters=GPIO_Label
PD12.GPIO_Label=LED1
PA6.Mode=Full_Duplex_Master
USB_DEVICE.CLASS_NAME_FS=CDC
PH0-OSC_IN.Signal=RCC_OSC_IN
RCC.CortexFreq_Value=168000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F407VGTx
PE11.GPIOParameters=GPIO_Label
SPI1.VirtualType=VM_MASTER
VP_ADC1_TempSens_Input.Mode=IN-TempSens
ADC1.ContinuousConvMode=ENABLE
PE11.GPIO_Label=CS1
SH.ADCx_IN2.0=ADC1_IN2,IN2
RCC.PLLCLKFreq_Value=168000000
PB14.GPIO_Label=STAT3
RCC.PLLQCLKFreq_Value=48000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_ADC1_Init-ADC1-false-HAL-true,5-MX_I2C3_Init-I2C3-false-HAL-true,6-MX_SPI1_Init-SPI1-false-HAL-true,7-MX_TIM3_Init-TIM3-false-HAL-true,8-MX_USB_DEVICE_Init-USB_DEVICE-false-HAL-false
PC3.Locked=true
PA11.Mode=Device_Only
RCC.RTCFreq_Value=32000
PA3.GPIOParameters=GPIO_Label
USB_DEVICE.VirtualMode-CDC_FS=Cdc
PB13.GPIO_Label=STAT2
PB13.Signal=GPIO_Output
PA2.GPIOParameters=GPIO_Label
PC15-OSC32_OUT.GPIO_Label=W1
PinOutPanel.RotationAngle=0
PE6.GPIO_Label=W4
PE5.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x6000
PD13.Signal=GPIO_Output
Mcu.IP4=RCC
RCC.FCLKCortexFreq_Value=168000000
Mcu.IP5=SPI1
PD13.Locked=true
Mcu.IP2=I2C3
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP3=NVIC
Mcu.IP0=ADC1
Mcu.IP1=DMA
NVIC.EXTI1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PA12.Signal=USB_OTG_FS_DP
PE4.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.UserConstants=
PD15.GPIOParameters=GPIO_Label
PE5.GPIO_PuPd=GPIO_PULLUP
USB_DEVICE.USBD_MAX_NUM_INTERFACES-CDC_FS=10
PC1.GPIOParameters=GPIO_Label
Mcu.ThirdPartyNb=0
ADC1.Channel-3\#ChannelRegularConversion=ADC_CHANNEL_TEMPSENSOR
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=168000000
SH.ADCx_IN3.0=ADC1_IN3,IN3
Mcu.IPNb=10
ADC1.Resolution=ADC_RESOLUTION_12B
RCC.I2SClocksFreq_Value=96000000
ProjectManager.PreviousToolchain=STM32CubeIDE
RCC.APB2TimFreq_Value=168000000
TIM3.Period=699
Dma.ADC1.0.Direction=DMA_PERIPH_TO_MEMORY
RCC.VcooutputI2S=96000000
ADC1.Channel-2\#ChannelRegularConversion=ADC_CHANNEL_11
ADC1.InjNumberOfConversion=0
SH.ADCx_IN3.ConfNb=1
SPI1.CalculateBaudRate=5.25 MBits/s
PC3.Signal=GPIO_Output
Mcu.Pin6=PC14-OSC32_IN
Mcu.Pin7=PC15-OSC32_OUT
NVIC.DMA2_Stream0_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PE5.Signal=GPIO_Input
Mcu.Pin8=PH0-OSC_IN
PE10.Locked=true
Mcu.Pin9=PH1-OSC_OUT
Dma.ADC1.0.MemDataAlignment=DMA_MDATAALIGN_WORD
RCC.AHBFreq_Value=168000000
PH0-OSC_IN.Mode=HSE-External-Clock-Source
PB13.Locked=true
Mcu.Pin0=PE2
Mcu.Pin1=PE3
PE14.Locked=true
GPIO.groupedBy=
Mcu.Pin2=PE4
Mcu.Pin3=PE5
Mcu.Pin4=PE6
PA0-WKUP.GPIOParameters=GPIO_Label
Mcu.Pin5=PC13-ANTI_TAMP
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_2
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=25000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ADC1.ScanConvMode=ENABLE
PC13-ANTI_TAMP.Signal=GPIO_Input
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PB12.GPIO_Label=STAT1
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.25.1
NVIC.I2C3_EV_IRQn=true\:0\:0\:false\:false\:true\:true\:true
MxDb.Version=DB.6.0.0
PE15.Locked=true
ADC1.Rank-2\#ChannelRegularConversion=3
PA1.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
PE13.Signal=GPIO_Output
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=1000000
PA14.Mode=Serial_Wire
TIM3.Prescaler=41999
Dma.ADC1.0.PeriphInc=DMA_PINC_DISABLE
File.Version=6
PE4.GPIO_Label=W6
PC9.Mode=I2C
PE3.GPIOParameters=GPIO_Label
SH.ADCx_IN11.ConfNb=1
PE3.Locked=true
PE2.Signal=GPIO_Output
PA8.Signal=I2C3_SCL
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PE10.Signal=GPIO_Output
PE4.Signal=GPIO_Input
PE6.GPIOParameters=GPIO_PuPd,GPIO_Label
Dma.RequestsNb=1
ProjectManager.HalAssertFull=false
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
PC14-OSC32_IN.GPIOParameters=GPIO_PuPd,GPIO_Label
ProjectManager.ProjectName=Fascin8_v3
USB_DEVICE.APP_RX_DATA_SIZE-CDC_FS=4
PH1-OSC_OUT.Mode=HSE-External-Clock-Source
RCC.MCO2PinFreq_Value=168000000
PD13.GPIO_Label=LED2
Mcu.Package=LQFP100
PA6.Signal=SPI1_MISO
PE10.GPIOParameters=GPIO_Label
PD12.Signal=GPIO_Output
NVIC.OTG_FS_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.ToolChainLocation=
PD14.Locked=true
PA2.GPIO_Label=ADC_25analog
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
USB_OTG_FS.VirtualMode=Device_Only
PE12.GPIO_Label=CS2
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
PB14.GPIOParameters=GPIO_Label
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.APB1TimFreq_Value=84000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.ADC1.0.FIFOMode=DMA_FIFOMODE_DISABLE
PC14-OSC32_IN.GPIO_Label=W2
USB_OTG_FS.IPParameters=VirtualMode
PE6.Locked=true
PC15-OSC32_OUT.GPIOParameters=GPIO_PuPd,GPIO_Label
PE10.GPIO_Label=CLKSEL2
Dma.Request0=ADC1
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_16
PE6.GPIO_PuPd=GPIO_PULLUP
PA1.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
PE2.GPIO_Label=O1
PC2.GPIO_Label=CLKSEL0
PE12.Locked=true
ADC1.EOCSelection=ADC_EOC_SEQ_CONV
PD15.Signal=GPIO_Output
ProjectManager.CustomerFirmwarePackage=
VP_TIM3_VS_ClockSourceINT.Mode=Internal
PC14-OSC32_IN.Locked=true
USB_DEVICE.USBD_DEBUG_LEVEL-CDC_FS=3
PA3.Signal=ADCx_IN3
PA5.Mode=Full_Duplex_Master
PC13-ANTI_TAMP.GPIOParameters=GPIO_PuPd,GPIO_Label
ProjectManager.ProjectFileName=Fascin8_v3.ioc
Dma.ADC1.0.Instance=DMA2_Stream0
PD15.GPIO_Label=LED4
ADC1.Rank-0\#ChannelRegularConversion=1
PA7.Mode=Full_Duplex_Master
PE14.GPIOParameters=GPIO_Label
Mcu.PinsNb=44
PC13-ANTI_TAMP.GPIO_PuPd=GPIO_PULLUP
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,CLKPhase
USB_DEVICE.VirtualModeFS=Cdc_FS
PC13-ANTI_TAMP.GPIO_Label=W3
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,master,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,NbrOfConversionFlag,ScanConvMode,ContinuousConvMode,Rank-1\#ChannelRegularConversion,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,Rank-2\#ChannelRegularConversion,Channel-2\#ChannelRegularConversion,SamplingTime-2\#ChannelRegularConversion,Rank-3\#ChannelRegularConversion,Channel-3\#ChannelRegularConversion,SamplingTime-3\#ChannelRegularConversion,NbrOfConversion,Resolution,DMAContinuousRequests,InjNumberOfConversion,EOCSelection
PC2.Signal=GPIO_Output
PD13.GPIOParameters=GPIO_Label
USB_DEVICE.USBD_MAX_STR_DESC_SIZ-CDC_FS=2048
ProjectManager.DefaultFWLocation=true
PE14.GPIO_Label=RSTN
SPI1.CLKPhase=SPI_PHASE_2EDGE
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB14.Locked=true
RCC.APB1CLKDivider=RCC_HCLK_DIV4
PC14-OSC32_IN.Signal=GPIO_Input
USB_DEVICE.IPParameters=VirtualMode-CDC_FS,VirtualModeFS,CLASS_NAME_FS,APP_RX_DATA_SIZE-CDC_FS,APP_TX_DATA_SIZE-CDC_FS,USBD_DEBUG_LEVEL-CDC_FS,USBD_MAX_NUM_INTERFACES-CDC_FS,USBD_MAX_NUM_CONFIGURATION-CDC_FS,USBD_MAX_STR_DESC_SIZ-CDC_FS
ADC1.SamplingTime-2\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
RCC.FamilyName=M
PA0-WKUP.GPIO_Label=CLKSEL1
PA0-WKUP.Signal=GPIO_Output
PA0-WKUP.Locked=true
PE15.GPIOParameters=GPIO_Label
PD12.Locked=true
PC3.GPIOParameters=GPIO_Label
PA13.Signal=SYS_JTMS-SWDIO
Dma.ADC1.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
PA9.Mode=Activate_VBUS
PC15-OSC32_OUT.Locked=true
PE15.GPIO_Label=PWDN
PD12.GPIOParameters=GPIO_Label
ProjectManager.TargetToolchain=STM32CubeIDE
Dma.ADC1.0.Mode=DMA_CIRCULAR
USB_DEVICE.APP_TX_DATA_SIZE-CDC_FS=4
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
Dma.ADC1.0.Priority=DMA_PRIORITY_LOW
PA9.Signal=USB_OTG_FS_VBUS
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_3
PE4.Locked=true
PE2.GPIOParameters=GPIO_Label
PC2.Locked=true
ProjectManager.RegisterCallBack=
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
PE11.Signal=GPIO_Output
RCC.LSE_VALUE=32768
PC15-OSC32_OUT.Signal=GPIO_Input
PA1.Signal=GPXTI1
RCC.VCOI2SOutputFreq_Value=192000000
PB14.Signal=GPIO_Output
PA5.Signal=SPI1_SCK
Mcu.Pin40=VP_ADC1_TempSens_Input
Mcu.Pin41=VP_SYS_VS_Systick
PE13.GPIOParameters=GPIO_Label
Mcu.Pin42=VP_TIM3_VS_ClockSourceINT
board=custom
Mcu.Pin43=VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS
RCC.VCOOutputFreq_Value=336000000
PC13-ANTI_TAMP.Locked=true
ProjectManager.LastFirmware=true
NVIC.TIM3_IRQn=true\:0\:0\:false\:false\:true\:true\:true
Dma.ADC1.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
NVIC.SPI1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.APB2Freq_Value=84000000
PE14.Signal=GPIO_Output
SH.ADCx_IN11.0=ADC1_IN11,IN11
PE15.Signal=GPIO_Output
MxCube.Version=6.0.1
Mcu.Pin37=PA12
Mcu.Pin38=PA13
Mcu.Pin35=PA9
Mcu.Pin36=PA11
SPI1.Mode=SPI_MODE_MASTER
Mcu.Pin39=PA14
PC2.GPIOParameters=GPIO_Label
SH.ADCx_IN2.ConfNb=1
VP_ADC1_TempSens_Input.Signal=ADC1_TempSens_Input
Mcu.Pin30=PD13
PC1.GPIO_Label=ADC_33digital
PA1.GPIO_Label=DRDY
VP_SYS_VS_Systick.Mode=SysTick
RCC.EthernetFreq_Value=168000000
Mcu.Pin33=PC9
TIM3.IPParameters=Prescaler,Period
PH1-OSC_OUT.Signal=RCC_OSC_OUT
Mcu.Pin34=PA8
Mcu.Pin31=PD14
Mcu.Pin32=PD15
PC15-OSC32_OUT.GPIO_PuPd=GPIO_PULLUP
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PD14.GPIO_Label=LED3
PE5.Locked=true
ADC1.DMAContinuousRequests=ENABLE
PE6.Signal=GPIO_Input
ADC1.NbrOfConversion=4
PA13.Mode=Serial_Wire
ProjectManager.FreePins=true
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VcooutputI2S
PE11.Locked=true
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F407V(E-G)Tx
PE12.Signal=GPIO_Output
Mcu.Pin26=PB12
Mcu.Pin27=PB13
RCC.RTCHSEDivFreq_Value=12500000
PA2.Signal=ADCx_IN2
Mcu.Pin24=PE14
ProjectManager.UnderRoot=true
PE4.GPIO_PuPd=GPIO_PULLUP
PE13.Locked=true
Mcu.Pin25=PE15
Mcu.IP8=USB_DEVICE
Mcu.IP9=USB_OTG_FS
Mcu.Pin28=PB14
PD14.Signal=GPIO_Output
Mcu.IP6=SYS
Mcu.Pin29=PD12
Mcu.IP7=TIM3
ProjectManager.CoupleFile=true
RCC.48MHZClocksFreq_Value=48000000
PD14.GPIOParameters=GPIO_Label
ADC1.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_3CYCLES
RCC.SYSCLKFreq_VALUE=168000000
Mcu.Pin22=PE12
Mcu.Pin23=PE13
PA1.Locked=true
Mcu.Pin20=PE10
ADC1.master=1
Mcu.Pin21=PE11
PE13.GPIO_Label=START
PA12.Mode=Device_Only
ADC1.Rank-3\#ChannelRegularConversion=4
ADC1.SamplingTime-3\#ChannelRegularConversion=ADC_SAMPLETIME_56CYCLES
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PE5.GPIO_Label=W5
ProjectManager.CompilerOptimize=6
ADC1.Rank-1\#ChannelRegularConversion=2
PD15.Locked=true
PA11.Signal=USB_OTG_FS_DM
PA14.Signal=SYS_JTCK-SWCLK
Dma.ADC1.0.MemInc=DMA_MINC_ENABLE
ProjectManager.HeapSize=0x3000
Mcu.Pin15=PA2
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PA3
Mcu.Pin13=PA0-WKUP
Mcu.Pin14=PA1
Mcu.Pin19=PA7
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PA5
RCC.HSI_VALUE=16000000
Mcu.Pin18=PA6
RCC.PLLQ=7
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
ADC1.NbrOfConversionFlag=1
USB_DEVICE.USBD_MAX_NUM_CONFIGURATION-CDC_FS=10
Mcu.Pin11=PC2
Mcu.Pin12=PC3
RCC.PLLM=25
NVIC.I2C3_ER_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.PLLN=336
Mcu.Pin10=PC1
PE2.Locked=true
PE3.Signal=GPIO_Output
PE3.GPIO_Label=O2
PC3.GPIO_Label=CS0
PC14-OSC32_IN.GPIO_PuPd=GPIO_PULLUP
PA8.Mode=I2C
PC9.Signal=I2C3_SDA
PE12.GPIOParameters=GPIO_Label
SH.GPXTI1.ConfNb=1
RCC.APB1Freq_Value=42000000
ProjectManager.DeviceId=STM32F407VGTx
PC1.Signal=ADCx_IN11
PB12.GPIOParameters=GPIO_Label
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
PA3.GPIO_Label=ADC_50power
PA7.Signal=SPI1_MOSI
